verification/openfoam/naturalConvection/openfoam/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    pipeWall    { type fixedValue; value uniform (0 0 0); }
    tunnelWall  { type fixedValue; value uniform (0 0 0); }
    downWall    { type fixedValue; value uniform (0 0 0); }
    inlet       { type fixedValue; value uniform (0 0 0); }
    outlet      { type fixedValue; value uniform (0 0 0); }
    cyclicLeft  { type cyclic; }
    cyclicRight { type cyclic; }
}
