verification/openfoam/naturalConvection/openfoam/constant/fvOptions
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

buoyancyTurbulence
{
    type            buoyancyTurbSource;
    selectionMode   all;
    beta            0.00344827586207;
    alphat          alphat;
    T               T;
}
