verification/openfoam/naturalConvection/openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    pipeWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       233200;
    }
    tunnelWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       235200;
    }
    downWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       236800;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       237600;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       238000;
    }
    cyclicLeft
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4000;
        startFace       238800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicRight;
    }
    cyclicRight
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4000;
        startFace       242800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclicLeft;
    }
)

// ************************************************************************* //
