verification/openfoam/naturalConvection/openfoam/constant/transportProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1.50250417362e-05;
beta            [0 0 0 -1 0 0 0] 0.00344827586207;
TRef            [0 0 0 1 0 0 0] 290;
Pr              [0 0 0 0 0 0 0] 0.7;
Prt             [0 0 0 0 0 0 0] 0.85;
