verification/openfoam/naturalConvection/openfoam/constant/turbulenceProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
simulationType  RAS;

RAS
{
    RASModel        kEpsilon;
    turbulence      on;
    printCoeffs     on;

    kEpsilonCoeffs
    {
        Cmu         0.09;
        C1          1.44;
        C2          1.92;
        sigmak      1.0;
        sigmaEps    1.3;
        Prt         0.85;
    }
}
