verification/openfoam/naturalConvection/openfoam/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 0.001;

vertices
(
    (75 0 0)       (262.5 0 0)       (600 0 0)
    (75 0 120)     (262.5 0 120)     (600 0 120)
    (75 0 1500)    (262.5 0 1500)    (600 0 1500)
    (53.03301 53.03301 0)       (185.61553 185.61553 0)
    (424.26407 424.26407 0)
    (53.03301 53.03301 120)     (185.61553 185.61553 120)
    (424.26407 424.26407 120)
    (53.03301 53.03301 1500)    (185.61553 185.61553 1500)
    (424.26407 424.26407 1500)
);

blocks
(
    hex (0 1 10 9 3 4 13 12) (20 20 20) simpleGrading (3 1 2)
    hex (1 2 11 10 4 5 14 13) (20 20 20) simpleGrading (1 1 2)
    hex (3 4 13 12 6 7 16 15) (20 20 80) simpleGrading (3 1 1.5)
    hex (4 5 14 13 7 8 17 16) (20 20 80) simpleGrading (1 1 1.5)
);

edges
(
    arc 0 9 (69.29096 28.70126 0)
    arc 1 10 (242.51838 100.4544 0)
    arc 11 2 (554.32772 229.61006 0)
    arc 3 12 (69.29096 28.70126 120)
    arc 4 13 (242.51838 100.4544 120)
    arc 14 5 (554.32772 229.61006 120)
    arc 6 15 (69.29096 28.70126 1500)
    arc 7 16 (242.51838 100.4544 1500)
    arc 17 8 (554.32772 229.61006 1500)
);

boundary
(
    pipeWall
    {
        type wall;
        faces ((0 9 12 3) (3 12 15 6));
    }
    tunnelWall
    {
        type wall;
        faces ((5 8 17 14));
    }
    downWall
    {
        type wall;
        faces ((0 1 10 9) (1 2 11 10));
    }
    inlet
    {
        type wall;
        faces ((2 5 14 11));
    }
    outlet
    {
        type wall;
        faces ((6 15 16 7) (7 16 17 8));
    }
    cyclicLeft
    {
        type cyclic;
        neighbourPatch cyclicRight;
        faces ((0 3 4 1) (1 4 5 2) (3 6 7 4) (4 7 8 5));
    }
    cyclicRight
    {
        type cyclic;
        neighbourPatch cyclicLeft;
        faces ((9 10 13 12) (10 11 14 13) (12 13 16 15) (13 14 17 16));
    }
);

mergePatchPairs ();
