verification/openfoam/naturalConvection/openfoam/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application     buoyantBoussinesqPimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.4;
deltaT          0.002;
writeControl    timeStep;
writeInterval   200;
purgeWrite      2;
writeFormat     ascii;
writePrecision  10;
runTimeModifiable true;

functions
{
    profiles
    {
        type                sets;
        libs                (sampling);
        writeControl        writeTime;
        interpolationScheme cellPoint;
        setFormat           raw;
        fields              (T U k epsilon nut alphat);
        sets
        (
            nearPipe
            {
                type    uniform;
                axis    z;
                start   (0.0739104 0.0306147 0.001);
                end     (0.0739104 0.0306147 1.499);
                nPoints 101;
            }
        );
    }

    wallYPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeFields     yes;
        executeControl  writeTime;
        writeControl    writeTime;
    }
}
