verification/openfoam/naturalConvection/openfoam/system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
ddtSchemes { default Euler; }
gradSchemes { default Gauss linear; }
divSchemes
{
    default                             none;
    div(phi,U)                          bounded Gauss upwind;
    div(phi,T)                          bounded Gauss upwind;
    turbulence                          bounded Gauss upwind;
    div(phi,k)                          $turbulence;
    div(phi,epsilon)                    $turbulence;
    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
wallDist { method meshWave; }
fluxRequired
{
    default no;
    p_rgh;
}
